app/Models/PetaModel.php

SELECT `pusat_oleh_oleh`.*, `kategori`.`nama_kategori`, `kategori`.`icon_marker`, `kategori`.`kategori_slug`, AVG(ulasan.rating) as rata_rata_rating, ST_AsGeoJSON(pusat_oleh_oleh.wilayah_polygon) as polygon_data
FROM `pusat_oleh_oleh`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `pusat_oleh_oleh`.`kategori_id`
LEFT JOIN `ulasan` ON `ulasan`.`toko_id` = `pusat_oleh_oleh`.`id`
GROUP BY `pusat_oleh_oleh`.`id`
---
    public function getAllLokasi()
    {
        return $this->db->table($this->table)
            ->select('
                pusat_oleh_oleh.*,
                kategori.nama_kategori,
                kategori.icon_marker,
                kategori.kategori_slug,
                AVG(ulasan.rating) as rata_rata_rating,
                ST_AsGeoJSON(pusat_oleh_oleh.wilayah_polygon) as polygon_data
            ') // <-- TAMBAHKAN ST_AsGeoJSON di sini
            ->join('kategori', 'kategori.id_kategori = pusat_oleh_oleh.kategori_id', 'left')
            ->join('ulasan', 'ulasan.toko_id = pusat_oleh_oleh.id', 'left')
            ->groupBy('pusat_oleh_oleh.id')
            ->get()->getResultArray();

SELECT *
FROM `kategori`
---
    public function getKategori()
    {
        // Mengambil kategori untuk filter di peta
        return $this->db->table('kategori')->get()->getResultArray();